[
    {
        "title": "Prashanth Neel set to commence work on 'KGF Chapter 3’ prior to 'Salaar 2' production",
        "author": "Admin",
        "date": "2023-08-12",
        "thumbnail": "https://i.ibb.co/Ypzw2yQ/kgf-2.jpg",
        "content": "Get ready for some power-packed entertainment ahead. Bengali TV channels are determined to take the entertainment quotient to the next level with their wholesome offerings that not only includes new daily soaps, or non fiction shows, but also premieres of block buster movies. Recently, Mithun Chakraborty and Dev starrer ‘Projapoti’ had its TV Premiere, ‘Abar Kanchenjunga’ is ready for its premiere on the small screen. And making the line up more interesting, K.G.F Chapter 2 is ready for its World TV Premiere. The dubbed version will be aired on a leading Bengali TV channel on May 28. Written and directed by Prashanth Neel, the movie was a smash hit. It was among the highest grossing films that managed to cast a sell on the audience with its crisp narration and action-packed sequences. Originally made in Kannada, the movie received a good response from pan-India audiences."
    },
    {
        "title": "MR-9’ to release in 18 halls locally, 151 across Canada and USA",
        "author": "Admin",
        "date": "2023-08-20",
        "thumbnail": "https://i.ibb.co/BN27pmd/mr9.jpg",
        "content": "After a long wait, Masud Rana adaptation MR-9: Do or Die will finally be released this Friday (August 25). Promotional activities surrounding the films have left no stone unturned, as the multinational cast members have been busy interacting with Bangladeshi media.Thus, on a press conference on Tuesday, the staggering budget of the film was revealed to be at Tk 83 crores. The film is set to be released in 18 theatres, across the country.According to Deadline, the film has struck a North American Distribution deal with Swapna Scarecrow. Saikot Salahuddin, head of Swapna Scarecrow Bangladesh also informed that MR-9 will be released across 151 halls across Canada and USA, being the only Bangladeshi film to do so. Since its release, the movie has been talked about extensively on social media. Unfortunately, the movie was not very successful through the first week of its release as very few audiences gathered to watch it.I always imagined the character of Masud Rana in a certain way since my school days but I wasn't really happy with the visualisation I saw on the screen. In short, it was unsatisfactory, said Mazhar Rubel, a Gazipur-based businessman, stepping out of the Jamuna Future Park Blockbuster Cinema. "
    },
    {
        "title": "Pirates Of The Caribbean 6 Story Has Been Bought By Disney, Johnny Depp To Do This ‘Weird’ Film? Co-Writer Breaks Silence!",
        "author": "Admin",
        "date": "2023-09-04",
        "thumbnail": "https://i.ibb.co/4KZzkFs/pirates.jpg",
        "content": "Some actors have breathed life into their on-screen characters; one such star is Johnny Depp as Pirates Of The Caribbean’s Captain Jack Sparrow. Johnny has played the notorious pirate in every single film in the franchise – The Curse of the Black Pearl, Dead Man’s Chest, At World’s End, On Stranger Tides and the 2017 instalment Dead Men Tell No Tales.Now, six years after the last part was released – which unfortunately was panned by critics and fans, there is an update about Pirates of the Caribbean 6. In a recent conversation, writer Craig Mazin – who is known for co-creating HBO’s The Last Of Us- teased his upcoming take on the popular Disney franchise. Read on to know all he said. During a recent interaction with LA Times, Craig Mazin spilled the beans on his Pirates of the Caribbean 6 story, co-written with Ted Elliot (Elliot penned the original movie Pirates film and its two sequels). Stating that work on this upcoming pirate film is on hold due to the ongoing WGA strike, Mazin revealed that the pitch for the sixth film in the franchise is quite different from the ones we’ve seen already. He said, “We pitched it and thought there’s no way they’re buying it, it’s too weird. And they did! And then he wrote a fantastic script and the strike happened and everyone’s waiting around.”"
    }
]